[
    {
        "id":"Thieves01",
        "name":"Thief Apprentice",
        "showInLog":1,
        "stages":[
            {
                "progress":5,
                "logText":"After giving the key of Luthor and talking with Umar about Andor,I felt the desire of ask him about Thieves' Guild itself.\nI want to join them to see what kind of jobs they do."
            },
            {
                "progress":10,
                "logText":"Umar told me to talk with Troublemaker about my first task into the Guild."
            },
            {
                "progress":15,
                "logText":"Troublemaker told me to bring three journals from spies of the guild.I have to talk with Leta in my village,then with Dunla,in Vilegard's tavern, and finally with Fanamor somewhere around Crossroads Guardhouse."
            },
            {
                "progress":20,
                "logText":"I have to remember to tell them the password \"You are no one.No one knows you.No one has seen you.\""
            },
            {
                "progress":25,
                "logText":"Leta gave me her journal and adviced me to don't raise suspicion.",
                "rewardExperience":250
            },
            {
                "progress":30,
                "logText":"I got Dunla's journal without any problem.Time to move on and get the last Journal.",
                "rewardExperience":650
            },
            {
                "progress":35,
                "logText":"Fanamor gave me her journal."
            },
            {
                "progress":40,
                "logText":"Fanamor has been gravely wounded,and the Feygard Scout catches the journal.",
                "rewardExperience":150
            },
            {
                "progress":45,
                "logText":"I talked again with Fanamor.She's losing blood quickly,so I have to bring her a bandage.I need to find a trusting priest.",
                "rewardExperience":750
            },
            {
                "progress":50,
                "logText":"Thoronir gave me a bandage.I have to return with Fanamor as soon as possible."
            },
            {
                "progress":51,
                "logText":"Unfortunately,I was not able of saving Fanamor's life.However,I still have that journal."
            },
            {
                "progress":55,
                "logText":"Fanamor is alive and will make her own way to return.",
                "rewardExperience":1000
            },
            {
                "progress":60,
                "logText":"I've returned to Troublemaker and gave him the journals.He told me about talking with Umar.",
                "rewardExperience":1750,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"Thieves02",
        "name":"Immaculate kidnapping",
        "showInLog":1,
        "stages":[
            {
                "progress":5,
                "logText":"After ending my first task,I'm considered a member of Thieves' Guild.Now to do highly risk task,Umar sent me to kidnap a noble woman from Feygard without be discovered.She has been seen in the Foaming Flask tavern."
            },
            {
                "progress":6,
                "logText":"Umar gave me an advice.My strength is not always the solution; this time I must \"use my tongue\" to don't raise suspicion in the tavern."
            },
            {
                "progress":10,
                "logText":"Ambelie Laumwill doesn't want to come with me peacefully.I cannot make a scene or guards will alert other patrols.Maybe talking with them would solve the situation."
            },
            {
                "progress":15,
                "logText":"I've \"used my tongue\" with the main Feygard soldier in the Foaming Flask tavern.He gave me permission to \"escort back\" Ambelie."
            },
            {
                "progress":20,
                "logText":"I knocked out Ambelie.Now is time to come back to the Guild."
            },
            {
                "progress":21,
                "logText":"I've decided not to capture Ambelie.Now I must think on another solution."
            },
            {
                "progress":24,
                "logText":"Ambelie gave me a very valuable neckace.Now I must talk with Umar and persuade him to don't pursue her."
            },
            {
                "progress":25,
                "logText":"It seems there has been a murder not so far of the tavern.Road is going to be closed until they catch the criminal.I need to search another way to arrive Fallhaven."
            },
            {
                "progress":30,
                "logText":"I've brought Ambelie to the basement safely.However, hiding her here can be a rashness.",
                "rewardExperience":1200
            },
            {
                "progress":35,
                "logText":"Umar believes there's a secure room for those types of job."
            },
            {
                "progress":40,
                "logText":"Now I've to talk Troublemaker about some place Umar believes It's okay to keep the hostage safe."
            },
            {
                "progress":45,
                "logText":"Troublemaker has given me the key of the Guild brig.I should bring Ambelie there until She wakes up.",
                "rewardExperience":1000
            },
            {
                "progress":50,
                "logText":"I've introduced the key and switched the lever.A hatchway has opened in the room."
            },
            {
                "progress":55,
                "logText":"I've left Ambelie in that ugly,dark and cold place...Now I should go back."
            },
            {
                "progress":60,
                "logText":"Troublemaker gave me some bread for Ambelie.The guild doesn't want her to starve to the death,indeed they want her to be confortable enough.I must go there again."
            },
            {
                "progress":65,
                "logText":"I've given the bread to Ambelie.Now I have to report Troublemaker about the job.",
                "rewardExperience":400
            },
            {
                "progress":70,
                "logText":"The job seems to be done.Finally I just have to talk with Umar again...However,I'm not feeling well with this.Kidnappings are definitely not my kind of job.",
                "rewardExperience":0
            },
            {
                "progress":75,
                "logText":"I've done this task successfully.Umar told me they have sent couriers to Feygard,so the ransom It's almost guaranteed.",
                "rewardExperience":4500,
                "finishesQuest":1
            },
            {
                "progress":76,
                "logText":"Umar took the necklace as a compensation for my errors.Everything is fine again.",
                "rewardExperience":2250,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"Thieves03",
        "name":"The ruthless Crackshot",
        "showInLog":1,
        "stages":[
            {
                "progress":1,
                "logText":"Time to rest and prepare myself to begin with the next job.I should go to the tavern."
            },
            {
                "progress":2,
                "logText":"I really need to take a break..."
            },
            {
                "progress":3,
                "logText":"I'm now fully rested,so I should go back to Umar."
            },
            {
                "progress":4,
                "logText":"Umar told me about a group of traitors led by a Guild's veteran.It seems he stole the Key of Luthor."
            },
            {
                "progress":5,
                "logText":"Umar told me the story about the one who is known by \"Crack shot\".He's probably the responsible of the murder in the Duleian road."
            },
            {
                "progress":10,
                "logText":"Crackshot and his henchmen are probably hiding somewhere in the Duleian road.I must ask people there whether they have seen'em.",
                "rewardExperience":0
            },
            {
                "progress":11,
                "logText":"Benbyr,a suspicious man outside Crossroads Guardhouse,seems to don't know what I'm talking about."
            },
            {
                "progress":15,
                "logText":"Crossroads guards told me that Feygard has sent more soldiers to the south, trying to find the criminals' hideout."
            },
            {
                "progress":20,
                "logText":"The barricade guard speaks too loud,but he said all I wanted to know.I need to be faster than the patrols and reach the hideout.\nThe hideout is near a place full of larval burrowers."
            },
            {
                "progress":21,
                "logText":"I've found a small hole which apparently leads to a cave.Probably Crackshot and his henchmen are hiding there."
            },
            {
                "progress":22,
                "logText":"I've reached the hideout and saw some recent blood stains...Maybe people were fighting there."
            },
            {
                "progress":23,
                "logText":"The blood trace goes further..."
            },
            {
                "progress":24,
                "logText":"I've heard screams and sword clashes near here...I should take a look."
            },
            {
                "progress":25,
                "logText":"That's a massacre.The feygard patrol reached the place,but they seem to have been killed.However,I must continue."
            },
            {
                "progress":26,
                "logText":"While I'm going through the corridor the air becomes thicker.The blood smell is stronger and you find another dying soldier.He tells you something about his sergeant and other guy."
            },
            {
                "progress":29,
                "logText":"I've found a crate during the mission,but I need to get rid of the guard first in order to open it."
            },
            {
                "progress":30,
                "logText":"I've talked with the patrol sergeant.He told me his history about what happened before.He's tired and wounded,so I'll avenge his fellows."
            },
            {
                "progress":31,
                "logText":"The patrol sergeant has left to call backup.Now I'm alone again.Time to defeat Crackshot.",
                "rewardExperience":1125
            },
            {
                "progress":35,
                "logText":"I've started fighthing with Crackshot."
            },
            {
                "progress":36,
                "logText":"I've tried to open the door behind Crackshot, but somehow I cannot introduce the key into the lock.Anyway,mission accomplished.I must report Umar."
            },
            {
                "progress":40,
                "logText":"Crackshot said something about the key.If he hasn't lied, It could be cursed.",
                "rewardExperience":1000
            },
            {
                "progress":45,
                "logText":"I've reported Umar about the situation and given him the key.He does not seem to want to tell me more about the key...Yet."
            },
            {
                "progress":50,
                "logText":"Finally, this job is done.Now I should take a rest and regain strength.",
                "rewardExperience":7500,
                "finishesQuest":1
            }
        ]
    }
]